App/househelp-api/scripts/perf/results-20260503-170857/services_list.txt
Running 30s test @ http://localhost:8080/api/v1/services
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.68ms   17.07ms 246.75ms   92.12%
    Req/Sec   569.72    122.25     0.88k    81.82%
  Latency Distribution
     50%   54.07ms
     75%   59.32ms
     90%   70.43ms
     99%  134.79ms
  204578 requests in 30.10s, 167.03MB read
  Non-2xx or 3xx responses: 204577
Requests/sec:   6796.69
Transfer/sec:      5.55MB